#定时任务
import time
from collections import deque, OrderedDict, Counter, UserList
from itertools import islice, batched, chain, groupby, product, permutations, combinations
from typing import Iterator, Any, get_origin, get_args

import schedule


# def task():
#     print('Task is running')
#     # 模拟耗时任务或等待时间
#     print('Task finished')
#
# schedule.every(5).seconds.do(task)
#
# while True:
#     schedule.run_pending()
#     time.sleep(1)
from docx import Document
from docx import Document
from docx.enum.text import WD_ALIGN_PARAGRAPH
from docx.shared import Pt, Inches


list_data:list[str] = ['企业账户信息表、中间号业务开通城市属性表、中间号企业组织属性表、企业号码资源属性表、号码入库任务表、号码入库明细表','企业账户信息表、中间号业务开通城市属性表、中间号企业组织属性表、企业号码资源属性表、号码入库任务表、号码入库明细表','企业账户信息表、中间号业务开通城市属性表、中间号企业组织属性表、企业号码资源属性表、号码入库任务表、号码入库明细表','号码入库任务表、号码入库明细表、邮件信息表','入库任务表、中间号业务开通城市属性表、企业号码资源属性表','入库任务表','入库任务表、中间号业务开通城市属性表','入库任务表','入库任务表、中间号业务开通城市属性表','入库任务表','入库任务表、中间号业务开通城市属性表','入库详情表','入库详情表、中间号业务开通城市属性表','入库详情表、中间号业务开通城市属性表','入库详情表、中间号业务开通城市属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表、企业号码资源属性表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表','号码分池任务表、号码分池详情表、中间号业务开通城市属性表','号码分池任务表、号码分池详情表、中间号业务开通城市属性表','号码分池任务表、号码分池详情表、中间号业务开通城市属性表','号码分池任务表、号码分池详情表、中间号业务开通城市属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码出库任务表、号码出库任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表、中间号业务开通城市属性表','号码分池任务表、号码分池任务明细表、企业号码资源属性表、中间号业务开通城市属性表','企业号码资源属性表、号码拨测任务表、号码拨测任务明细表','企业号码资源属性表、号码拨测任务表、号码拨测任务明细表']
for i in list_data:
    print(f"{i}")
    print('【功能描述】')
    print('略')
    print('【系统界面】')
    print('略')
    print('【输入】')
    print('略')
    print('【输出】')
    print('略')
    print('【本事务功能涉及到的数据文件】（即FTR/RET）')
    print('（1）本期新增/变更的内部逻辑文件：（无）')
    print('（2）本期涉及原有但没修改的内部逻辑文件：（无）')
    print('（3）本期新增/变更的外部接口文件：（无）')
    print('（4）本期涉及原有但没修改的外部接口文件：（无）')